package com.example.krushikadam;


import android.annotation.SuppressLint;
import android.content.Intent;
import android.graphics.Color;
import android.graphics.drawable.ColorDrawable;
import android.graphics.drawable.Drawable;
import android.os.Bundle;
import android.widget.ImageView;
import android.widget.TextView;

import androidx.appcompat.app.ActionBar;
import androidx.appcompat.app.AppCompatActivity;

import com.denzcoskun.imageslider.ImageSlider;
import com.denzcoskun.imageslider.models.SlideModel;

import java.util.ArrayList;
import java.util.List;

public class tmp extends AppCompatActivity {

    String jr, bjr, mk;
    TextView t1, ijm, jl, iprn, ikht, ipn, ikid, pni, kid, pn;
    ImageView ig;
    List<SlideModel> sld;
    ImageSlider img = null;

    @SuppressLint("WrongViewCast")
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_tmp);

       // getSupportActionBar().setBackgroundDrawable(new ColorDrawable(getResources().getColor(R.color.green)));

        sld = new ArrayList<>();

        // Move the intent handling inside onCreate
        Intent gt = getIntent();
        int flag = 0;
       final String  bj = gt.getStringExtra("bjr");
       final String  jrm = gt.getStringExtra("jr");

        flag = gt.getIntExtra("flag", 0);

        String b = "बाजरी", m = "मका", j = "ज्वारी", g = "गहू";
        t1 = findViewById(R.id.ttl);

        ijm = findViewById(R.id.ijm);
        iprn = findViewById(R.id.iprn);
        ikht = findViewById(R.id.ikht);
        ipn = findViewById(R.id.ipn);
        ikid = findViewById(R.id.ikid);
        img = findViewById(R.id.sld);
        pni = findViewById(R.id.pni);
        kid = findViewById(R.id.kid);
        jl = findViewById(R.id.jmn);
        pn = findViewById(R.id.prn);
        // Assuming ig is an instance of ImageView
        Drawable bijri, mki, jwi;
        bijri = getResources().getDrawable(R.drawable.bajri);
        mki = getResources().getDrawable(R.drawable.mka);
        jwi = getResources().getDrawable(R.drawable.jri);


        if (flag == 1) {
            sld.add(new SlideModel(R.drawable.g1));
            sld.add(new SlideModel(R.drawable.g2));
            sld.add(new SlideModel(R.drawable.ghu));
            img.setImageList(sld, true);
            t1.setText(g);
        }
        if (flag == 2) {
            t1.setText(b);
            ijm.setText("अधिक उत्पादनासाठी पाण्याचा चांगला निचरा होणारी मध्यम ते भारी जमीन निवडावी. जमिनीचा सामू 6.5 ते 7.5 च्या दरम्यान असावा चांगल्या उगवणीसाठी जमीन भुसभुशीत, ढेकळे विरहित व दाबून घट्ट केलेली असावी. यासाठी अर्धा फूट खोल नांगरट करून दोन ते तीन वखराच्या पाळ्या देऊन शेवटच्या वखरणीपूर्वी कुजलेले शेणखत जमिनीत चांगले मिसळून घ्यावे");
            iprn.setText("पावसाळा सुरू झाल्यानंतर 75 ते 100 मी.मी. पाऊस झाल्यास पेरणी करावी.");
            ikht.setText("अधिक उत्पादनासाठी दहा किलो झिंक सल्फेट प्रति हेक्टरी पूर्वमशागतीच्या वेळेस जमिनीतून द्यावे. स्फुरदाची मात्रा सिंगल सुपर फॉस्फेटमधून दिल्यास पिकास कॅल्शिअम व सल्फर ही अतिरिक्त सूक्ष्म अन्नद्रव्येही मिळतात. (माती परीक्षणानुसारच रासायनिक खते द्यावीत.)");
            ipn.setText("बाजरी पिकास फुटवे येण्याची वेळ, पीक पोटरी अवस्थेत असताना आणि कणसात दाणे भरताना जमिनीत पुरेसा ओलावा असणे गरजेचे आहे. या अवस्थेत जमिनीत पुरेशी ओल नसल्यास पिकास संरक्षित ओलित म्हणून पावसाचा अंदाज बघून हलकेसे पाणी द्यावे");
            ikid.setText("केवडा- या रोगाचा प्रादुर्भाव उगवणीपासून ते दाणे भरेपर्यंत दिसून येतो. हा रोग झाल्यानंतर बाजरीचे लहान रोपे पिवळे पडतात. त्याच्या खालील बाजूस पांढऱ्या बुरशीची वाढ होते. त्यामुळे लहान रोपांवर चट्टे पडतात किंवा त्यांची मर होते. कणसातील फुलांचे रूपांतर पर्ण पत्रात होऊन कणसात दाणे भरत नाहीत. कणीस विस्कटलेली दिसते.");
            sld.add(new SlideModel(R.drawable.b1));
            sld.add(new SlideModel(R.drawable.b2));
            sld.add(new SlideModel(R.drawable.bajri));
            //sld.add(new SlideModel(R.drawable.));
            kid.setText("बाजरीवरील कीड व प्रादुर्भाव");
            img.setImageList(sld, true);
        }
        if (flag == 3) {
            t1.setText(j);
            sld.add(new SlideModel(R.drawable.j1));
            sld.add(new SlideModel(R.drawable.j2));
            sld.add(new SlideModel(R.drawable.jri));
            img.setImageList(sld, true);
            ijm.setText("ज्वारीच्या पिकाच्या बाबत पिकांच्या फेरपालटीची आवश्यकता असते. त्याकरिता ज्वारीच्या पिकाची कडधान्याच्या पिकाबरोबर फेरपालट करणे जास्त उपयुक्त ठरते. फेरपालटीमुळे जमिनीच्या एकाच पातळीतील वनस्पतीपोषक द्रव्यांचे शोषण होत नाही. मुळे खोलवर जाणाऱ्या पिकानंतर ज्याची मुळे जास्त खोलवर जात नाहीत, असे पीक त्याच जमिनीत लावल्यास दोन्ही पिके चांगली येतात. कडधान्याच्या मुळांवरील गाठींमुळे त्या पिकाखालच्या जमिनीतील नायट्रोजनाचे प्रमाण वाढून नंतरचे त्याच शेतातील ज्वारीचे पीक चांगले येते. उत्तर भारतात बार्ली, गहू अगर भात व वाटाण्यानंतर ज्वारी पेरतात. मध्य व दक्षिण भारतात कापूस अगर कडधान्याच्या पिकाबरोबर ज्वारीच्या पिकाची फेरपालट करतात. बागायती ज्वारीची फेरपालट मिरची, तंबाखू, भुईमूग वगैरे पिकांबरोबर करतात.\nमशागत\n" +
                    "या पिकाकरिता जमीन दर वर्षी नांगरीत नाहीत. तीन-चार वर्षांतून एकदा नांगरली तरी चालते. मे महिन्यात दोन-तीन वेळा १०–१२ सेंमी. खोलीपर्यंत जमीन कुळवाने मोकळी करतात.");
            iprn.setText("एकूण हंगाम तीन असतात. पावसाळी (खरीप), हिवाळी (रबी) व उन्हाळी. पावसाळी हंगामातील जाती जून-जुलैमध्ये व हिवाळी हंगामातील जाती सप्टेंबर-ऑक्टोबरमध्ये पेरतात. खरीप व रबी पिके दाणे आणि वैरणीसाठी लावतात. उन्हाळी पिके ओल्या वैरणीसाठी लावतात. पीक लावण्याचे जिरायत (कोरडवाहू) व बागायत (ओलीताखालचे पीक) असे दोन प्रकार आहेत. जिरायत पिकाच्या पद्धती पुढीलप्रमाणे आहेत.");
            ikht.setText("वार्षिक ७५ ते ८२ सेंमी. पाऊस पडणाऱ्या क्षेत्रात ज्वारीच्या कोरडवाहू पिकाला हेक्टरी ६ टन आणि बागायती पिकाला १२ ते १८ टन शेणखत अगर कंपोस्ट पूर्व मशागतीच्या वेळी देतात. हेक्टरी ८० किग्रॅ. नायट्रोजन मिळेल असे कोणतेही रासायनिक खत आणि १९० किग्रॅ. सुपरफॉस्फेट पेरणीच्या वेळी देतात. निरनिराळ्या प्रयोगांवरून असे आढळून आले आहे की, हेक्टरी २० ते ४० किग्रॅ. पेक्षा जास्त नायट्रोजन आणि २०–३० किग्रॅ. पेक्षा फॉस्फोरिक अम्ल दिल्यास भारतातील स्थानिक प्रकारांच्या उत्पन्नात वाढीव खताच्या प्रमाणात वाढ होत नाही. मात्र संकरित (हायब्रीड) ज्वारीच्या प्रकारांना जास्त खत दिल्यास स्थानिक जातींच्या तुलनेने जास्त उत्पन्न येते. निरनिराळ्या राज्यांतील बागायत आणि कोरडवाहू तसेच स्थानिक आणि संकरित प्रकारांसाठी रासायनिक खतांच्या वेगवेगळ्या मात्रा प्रयोगान्ती ठरविण्यात आल्या आहेत. बागायती पिकाला कोरडवाहू पिकापेक्षा जास्त आणि स्थानिक प्रकारांपेक्षा संकरित प्रकारांना जास्त खतांची मात्रा ठरविण्यात आली आहे. महाराष्ट्रासाठी कृत्रिम खतांतील घटकांचे हेक्टरी प्रमाण खालील कोष्टका मध्ये दिल्याप्रमाणे शिफारस करण्यात आले आहे.");
            pni.setText("आंतर मशागत");
            ipn.setText("पेरणीनंतर (अगर बी टोकल्यानंतर) सु. तीन आठवड्यांनी पिकाला कोळपणी देतात. निंदणी करून ओळीतील तण काढून घेतात. पुढे तर पंधरा दिवसांनी पिकाला कोळपणी देतात. पिकात तण वाढू देत नाहीत. कोळपणीमुळे जमीन भेगाळत नाही, पिकाच्या मुळांना हवेचा, वनस्पतिपोषक द्रव्यांचा व पाण्याचा पुरेसा पुरवठा होतो. एकूण ३–४ कोळपण्या व दोन-तीन खुरपण्या देतात. दुष्काळी अगर कमी पावसाच्या विभागात अकोला कोळप्यासारख्या कोळप्याने कोळपणी करतात.");
            kid.setText("उत्पन्न");
            ikid.setText("जमिनीचा दर्जा, पर्जन्यमान (अथवा पाणी पुरवठ्याची साधने), खताची मात्रा आणि मशागत यांवर ज्वारीचे उत्पन्न अवलंबून असते. त्यामुळे गावोगावी त्यात फरक आढळतो. १९६८–६९ ते १९७२–७३ या पाच वर्षांच्या काळात ज्वारीचे भारतातील सरासरी हेक्टरी उत्पन्न ४८१ किग्रॅ. होते. कोरडवाहू खरीप ज्वारीचे हेक्टरी उत्पन्न सर्वसाधारणपणे ४०० ते ५०० किग्रॅ. असते व दाण्याच्या तीन ते साडेतीन पट कडब्याचे उत्पन्न मिळते. कोरडवाहू रबी ज्वारीचे उत्पन्न हेक्टरी ६५० ते ७५० किग्रॅ. असते व दाण्याच्या दोन ते अडीच पट कडब्याचे उत्पन्न मिळते. बागायती ज्वारीचे हेक्टरी उत्पन्न १,२०० ते १,८०० किग्रॅ. असते. भारी जमिनीत ते हेक्टरी ४,००० किग्रॅ. पर्यंतही असते. ओल्या वैरणीचे उत्पन्न हलक्या जमिनीत हेक्टरी २० टन आणि भारी जमिनीत ३० ते ३५ टन मिळते.");
        }
        if (flag == 4) {
            t1.setText(m);
            sld.add(new SlideModel(R.drawable.mka));
            sld.add(new SlideModel(R.drawable.m1));
            sld.add(new SlideModel(R.drawable.m2));
            img.setImageList(sld, true);
            ijm.setText("ज्वारीच्या पिकाच्या बाबत पिकांच्या फेरपालटीची आवश्यकता असते. त्याकरिता ज्वारीच्या पिकाची कडधान्याच्या पिकाबरोबर फेरपालट करणे जास्त उपयुक्त ठरते. फेरपालटीमुळे जमिनीच्या एकाच पातळीतील वनस्पतीपोषक द्रव्यांचे शोषण होत नाही. मुळे खोलवर जाणाऱ्या पिकानंतर ज्याची मुळे जास्त खोलवर जात नाहीत, असे पीक त्याच जमिनीत लावल्यास दोन्ही पिके चांगली येतात. कडधान्याच्या मुळांवरील गाठींमुळे त्या पिकाखालच्या जमिनीतील नायट्रोजनाचे प्रमाण वाढून नंतरचे त्याच शेतातील ज्वारीचे पीक चांगले येते. उत्तर भारतात बार्ली, गहू अगर भात व वाटाण्यानंतर ज्वारी पेरतात. मध्य व दक्षिण भारतात कापूस अगर कडधान्याच्या पिकाबरोबर ज्वारीच्या पिकाची फेरपालट करतात. बागायती ज्वारीची फेरपालट मिरची, तंबाखू, भुईमूग वगैरे पिकांबरोबर करतात.\nमशागत\n" +
                    "या पिकाकरिता जमीन दर वर्षी नांगरीत नाहीत. तीन-चार वर्षांतून एकदा नांगरली तरी चालते. मे महिन्यात दोन-तीन वेळा १०–१२ सेंमी. खोलीपर्यंत जमीन कुळवाने मोकळी करतात.");
            iprn.setText("एकूण हंगाम तीन असतात. पावसाळी (खरीप), हिवाळी (रबी) व उन्हाळी. पावसाळी हंगामातील जाती जून-जुलैमध्ये व हिवाळी हंगामातील जाती सप्टेंबर-ऑक्टोबरमध्ये पेरतात. खरीप व रबी पिके दाणे आणि वैरणीसाठी लावतात. उन्हाळी पिके ओल्या वैरणीसाठी लावतात. पीक लावण्याचे जिरायत (कोरडवाहू) व बागायत (ओलीताखालचे पीक) असे दोन प्रकार आहेत. जिरायत पिकाच्या पद्धती पुढीलप्रमाणे आहेत.");
            ikht.setText("वार्षिक ७५ ते ८२ सेंमी. पाऊस पडणाऱ्या क्षेत्रात ज्वारीच्या कोरडवाहू पिकाला हेक्टरी ६ टन आणि बागायती पिकाला १२ ते १८ टन शेणखत अगर कंपोस्ट पूर्व मशागतीच्या वेळी देतात. हेक्टरी ८० किग्रॅ. नायट्रोजन मिळेल असे कोणतेही रासायनिक खत आणि १९० किग्रॅ. सुपरफॉस्फेट पेरणीच्या वेळी देतात. निरनिराळ्या प्रयोगांवरून असे आढळून आले आहे की, हेक्टरी २० ते ४० किग्रॅ. पेक्षा जास्त नायट्रोजन आणि २०–३० किग्रॅ. पेक्षा फॉस्फोरिक अम्ल दिल्यास भारतातील स्थानिक प्रकारांच्या उत्पन्नात वाढीव खताच्या प्रमाणात वाढ होत नाही. मात्र संकरित (हायब्रीड) ज्वारीच्या प्रकारांना जास्त खत दिल्यास स्थानिक जातींच्या तुलनेने जास्त उत्पन्न येते. निरनिराळ्या राज्यांतील बागायत आणि कोरडवाहू तसेच स्थानिक आणि संकरित प्रकारांसाठी रासायनिक खतांच्या वेगवेगळ्या मात्रा प्रयोगान्ती ठरविण्यात आल्या आहेत. बागायती पिकाला कोरडवाहू पिकापेक्षा जास्त आणि स्थानिक प्रकारांपेक्षा संकरित प्रकारांना जास्त खतांची मात्रा ठरविण्यात आली आहे. महाराष्ट्रासाठी कृत्रिम खतांतील घटकांचे हेक्टरी प्रमाण खालील कोष्टका मध्ये दिल्याप्रमाणे शिफारस करण्यात आले आहे.");
            pni.setText("आंतर मशागत");
            ipn.setText("पेरणीनंतर (अगर बी टोकल्यानंतर) सु. तीन आठवड्यांनी पिकाला कोळपणी देतात. निंदणी करून ओळीतील तण काढून घेतात. पुढे तर पंधरा दिवसांनी पिकाला कोळपणी देतात. पिकात तण वाढू देत नाहीत. कोळपणीमुळे जमीन भेगाळत नाही, पिकाच्या मुळांना हवेचा, वनस्पतिपोषक द्रव्यांचा व पाण्याचा पुरेसा पुरवठा होतो. एकूण ३–४ कोळपण्या व दोन-तीन खुरपण्या देतात. दुष्काळी अगर कमी पावसाच्या विभागात अकोला कोळप्यासारख्या कोळप्याने कोळपणी करतात.");
            kid.setText("उत्पन्न");
            ikid.setText("जमिनीचा दर्जा, पर्जन्यमान (अथवा पाणी पुरवठ्याची साधने), खताची मात्रा आणि मशागत यांवर ज्वारीचे उत्पन्न अवलंबून असते. त्यामुळे गावोगावी त्यात फरक आढळतो. १९६८–६९ ते १९७२–७३ या पाच वर्षांच्या काळात ज्वारीचे भारतातील सरासरी हेक्टरी उत्पन्न ४८१ किग्रॅ. होते. कोरडवाहू खरीप ज्वारीचे हेक्टरी उत्पन्न सर्वसाधारणपणे ४०० ते ५०० किग्रॅ. असते व दाण्याच्या तीन ते साडेतीन पट कडब्याचे उत्पन्न मिळते. कोरडवाहू रबी ज्वारीचे उत्पन्न हेक्टरी ६५० ते ७५० किग्रॅ. असते व दाण्याच्या दोन ते अडीच पट कडब्याचे उत्पन्न मिळते. बागायती ज्वारीचे हेक्टरी उत्पन्न १,२०० ते १,८०० किग्रॅ. असते. भारी जमिनीत ते हेक्टरी ४,००० किग्रॅ. पर्यंतही असते. ओल्या वैरणीचे उत्पन्न हलक्या जमिनीत हेक्टरी २० टन आणि भारी जमिनीत ३० ते ३५ टन मिळते.");
        }

        switch (flag) {
            case 5:
                config("टरबूज", "जाती", "दुर्गापूर मधु - मध्यम अवधीत तयार होणारी जात असून फळे लांबट लहान असून साल फिक्कट हिरव्या रंगाची असते व त्यावर हिरव्या रंगाच्या धरी असतात. गर फिक्कट हिरव्या रंगाचा गोड असतो.\n" +
                        "\n" +
                        "अर्का जीत – ही लावकर येणारी जात असून फळांचे वजन ४०० ते ८०० ग्रॅम असते. फळे आकाराने गोल, आकर्षक व पिवळ्या रंगाचे असते.\n" +
                        "\n" +
                        "या शिवाय लखनऊ सफेदा, खारीधारी, फैजाबादी इत्यादी स्थानिक जाती लागवडीस योग्य आहेत.", "काढणी व उत्पादन", "कलिंगड व खरबूज काढणी फळ पुर्ण पिकल्यावर करतात. नदीच्या पत्रातील फळे बगयातीपेक्षाथोडी लवकर तयार होतात. बी पेरल्यापासून ३ ते ३.५ महिन्यात काढणी सुरु होते व ३ ते ४ आवडयात पुर्ण होते. आकार व रंगावरून फळांची पक्वता ठरविणे कठीण आहे. फळ तयार झाल्याची काही लक्षणे खालील प्रमाने आहेत.", "रोग व कीड", "भुरी - या रोगाची सुरवात पानापासून होते. पानाच्या खालच्या बाजूस पिठासारखी बुरशी वाढते. नंतर ती पंच्या पृष्टभागाव्रर वाढते त्यामुळे पाने पांढरी दिसतात. रोगाचे प्रमाण वाढल्यावर पाने पिवळी पडून गळतात.", R.drawable.t1, R.drawable.t2, R.drawable.t3, "", "");
                break;
            case 6:
                config("काकडी", "हवामान आणि जमीन", "काकडी हे उष्ण आणि कोरडया हवामानात वाढणारे पीक आहे. पाण्याचा उत्तम निचरा होणारी मध्यम ते भारी जमीन या पिकास योग्य असते.\n" +
                        "\n" +
                        "काकडी लागवडीसाठी मातीचे पीएच(सामू ) 6-7 दरम्यान असावा. उच्च तापमानात त्याची लागवड चांगली आहे. आणि हा थंडी सहन करू शकत नाही. म्हणून, जायद (उन्हाळ्यात)हंगामात त्याची लागवड करणे चांगले आहे.काकडी लागवडीसाठी मातीचे पीएच(सामू ) 6-7 दरम्यान असावा. उच्च तापमानात त्याची लागवड चांगली आहे. आणि हा थंडी सहन करू शकत नाही. म्हणून, जायद (उन्हाळ्यात)हंगामात त्याची लागवड करणे चांगले आहे.\n" +
                        "\n" +
                        "या शिवाय लखनऊ सफेदा, खारीधारी, फैजाबादी इत्यादी स्थानिक जाती लागवडीस योग्य आहेत.", "लागवडीचा हंगाम", "काकडीची लागवड खरीप आणि उन्हाळी हंगामात होते. खरीप हंगामासाठीकाकडीची लागवड जून जूलै महिन्यात व उन्हाळी हंगामामध्ये जानेवारी महिन्यात करतात.तर डोंगराळ भागात त्याची लागवड मार्च व एप्रिल महिन्यात होते.", "खते व पाणी व्यवस्थापन", "लागवडीच्या तयारीच्या 15-20 दिवसांपूर्वी 20-25 टन प्रति हेक्टर शेणखत टाकावे.", R.drawable.k1, R.drawable.k2, R.drawable.k3, "", "");
                break;
            case 7:
                config("भुईमूग", "आंतरमशागत", "पेरणीनंतर नांगे आढळून आल्यास बी टोकून ते ताबडतोब भरावेत. १० ते १२ दिवसांच्या अंतराने २ ते ३ कोळपण्या कराव्यात व २ निंदण्या (खुरपण्या) द्याव्या. शेवटची कोळपणी थोडी खोल द्यावी त्यामुळे पिकास मातीची भर मिळते. भुईमूगाच्या आ-या जमिनीत जाण्यास सुरुवात झाल्यावर आंतरमशागत करु नये.\n" +
                        "\n" +
                        "अर्का जीत – ही लावकर येणारी जात असून फळांचे वजन ४०० ते ८०० ग्रॅम असते. फळे आकाराने गोल, आकर्षक व पिवळ्या रंगाचे असते.\n" +
                        "\n" +
                        "या शिवाय लखनऊ सफेदा, खारीधारी, फैजाबादी इत्यादी स्थानिक जाती लागवडीस योग्य आहेत.", "पाणी व्यवस्थापन", "खरीप भुईमूगास फुले येण्याची अवस्था (पेरणीनंतर २० ते ३० दिवस)., आ-या सुटण्याची अवस्था (४० ते ४५ दिवस) आणि शेंगा पोसण्याची अवस्था (६५ ते ७० दिवस) या अवस्थांमध्ये पावसाने ताण दिल्यास संरक्षित पाण्याची पाळी द्यावी. भुईमूग पेर", "पीक सरंक्षण", "फुलकिडे, तुडतुडे यांच्या नियंत्रणासाठी १० मिली किंवा ८ मिली, डिमॅटोन १५ टक्के प्रवाही औषध १० लिटर पाण्यात मिसळून फवारणी करावी आणि पाने खाणारी अळी व पाने गुंडाळणारी अळीच्या नियंत्रणासाठी सायपरमेथ्रीन २० इ.सी  ४ मिली किंवा डेकामेथ्रीन २८ इ.सीय १० मिली किंवा किनॉसफॉस २५ इ.सी. २० मिली १० लिटर", R.drawable.bh1, R.drawable.bh2, R.drawable.bh3, "पीक तयार झाले म्हणजे पाने पिवळी पडू लागतात. शेंगाचे टरफल टणक बनते व शेंगाच्या टरफलाची आतील बाजू काळी दिसू लागते. अशा प्रकारे पीक तयार झाल्यावर काढणी वरील तंत्रज्ञानाचा वापर केल्यास खरीपात सरासरी १८ ते २० क्विंटल/हेक्टर तर उन्हाळी भुईमूगाचे २५ ते ३० क्विंटल/हेक्टर उत्पादन मिळू शकते.", "काढणी व उत्पादन");

                break;

            case 8:
                config("सूर्यफूल", "जाती", "सुधारित जातीपैकी फुले भास्कर, एस एस ५६, मॉर्डेन ६८४१४, भानू या जातींची निवड करावी. तर संकरित वाणापैकी के बी एस एच १, एल एफ एस एच १७१३५, एल एस एफ एच ४४, फुले रविराज, एम एस एफ एच १७ या वाणांची निवड करावी.\n" +
                        "अर्का जीत – ही लावकर येणारी जात असून फळांचे वजन ४०० ते ८०० ग्रॅम असते. फळे आकाराने गोल, आकर्षक व पिवळ्या रंगाचे असते.\n" +
                        "\n" +
                        "या शिवाय लखनऊ सफेदा, खारीधारी, फैजाबादी इत्यादी स्थानिक जाती लागवडीस योग्य आहेत.", "पेरणीची वेळ", "जुलैच्या पहिला पंधरवड्यात पेरणी करता येते. पेरणीचे अंतर मध्यम ते खोल जमिनीत ४५ सेंटीमीटर बाय ३० सेंटिमीटर भारी जमिनीत ६० सेंमी बाय ३० सेंमी तसेच संकरित वाण आणि जास्त कालावधीच्या वाणाची लागवड ६० सेंमी बाय ३० सेंमी अंतरावर करावी. कोरडवाहू सूर्यफुलाची पेरणी दोन चाडाच्या पाभरीने करावी. म्हणजे बी आणि खत एकाच वेळी पेरता येते. बियाणे ५ सेमी पेक्षा जास्त खोल पेरू नये. बागायती पिकाची लागवड सरी वरंब्यावर टोकण पद्धतीने करावी.\n", "काढणी", "सूर्यफुलाची पाने देठ व फुलांची मागील बाजू पिवळी झाल्यानंतर पिकाची कापणी करावी. कणसे चांगले वाळवून नंतर मळणी करावी. कोरडवाहू पिकापासून प्रतिहेक्टरी आठ ते दहा क्विंटल संकरित वाणापासून १२ ते १५ क्विंटल आणि बागायती संकरित वाणापासून प्रतिहेक्टरी १७ ते २० क्विंटल उत्पादन मिळते.\n", R.drawable.sn1, R.drawable.sn2, R.drawable.sn3, "सूर्यफुलाची पाने देठ व फुलांची मागील बाजू पिवळी झाल्यानंतर पिकाची कापणी करावी. कणसे चांगले वाळवून नंतर मळणी करावी. कोरडवाहू पिकापासून प्रतिहेक्टरी आठ ते दहा क्विंटल संकरित वाणापासून १२ ते १५ क्विंटल आणि बागायती संकरित वाणापासून प्रतिहेक्टरी १७ ते २० क्विंटल उत्पादन मिळते.\n", "काढणी व उत्पादन");

                break;
        }

    }



    public void config(String m, String j, String jm, String p, String pr, String kd, String ikd, int ig1, int ig2, int ig3, String np, String nip) {
        t1.setText(m);
        jl.setText(j);
        sld.add(new SlideModel(ig1));
        sld.add(new SlideModel(ig2));
        sld.add(new SlideModel(ig3));
        img.setImageList(sld, true);
        pn.setText(p);
        pni.setText(nip);
        ipn.setText(np);
        ijm.setText(jm);
        iprn.setText(pr);
        kid.setText(kd);
        ikid.setText(ikd);
    }
}



